controllers/CategoryController.php

    public function actionCreate()
    {
        $model = new Category();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
            return $this->redirect(['view', 'id' => $model->id]);
        } else {
            $category_parent_id_all[0] = "根节点";

            $category_parent_id_all_tmp = Category::find()->all();
---
INSERT INTO `tbl_category` (`name`, `parent_id`) VALUES ('空气', 0)
SELECT * FROM `tbl_category`

    public function actionUpdate($id)
    {
        $model = $this->findModel($id);

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
            return $this->redirect(['view', 'id' => $model->id]);
        } else {
            $category_parent_id_all[0] = "根节点";

            $category_parent_id_all_tmp = Category::find()->all();
---
SELECT * FROM `tbl_category`

    protected function findModel($id)
    {
        if (($model = Category::findOne($id)) !== null) {
---
SELECT * FROM `tbl_category` WHERE `id`='4'