controllers/ProductController.php

    protected function findModel($id)
    {
        if (($model = Product::findOne($id)) !== null) {
---
SELECT * FROM `tbl_product` WHERE `id`='2'