controllers/ShifuController.php

SELECT * FROM `tbl_shifu` WHERE `id`='4'
---
    protected function findModel($id)
    {
        if (($model = Shifu::findOne($id)) !== null) {