controllers/SkulistController.php

    protected function findModel($id)
    {
        if (($model = SkuList::findOne($id)) !== null) {
---
SELECT * FROM `tbl_sku_list` WHERE `id`='8'