<?php

return [
//    'adminEmail' => 'admin@example.com',
        'service_verion'=>[
            //service类名 => 'service'文件夹下对应的文件夹名字
//            'TestTmp' => 'a_0',
            'Imguploader' => 'a_0',
            'Batch_excel' => 'a_0',
            'MinutesResExcel' => 'a_0',
           
        ],
	'sexlist'=>[1=>'男',2=>'女',0=>'未知'],
	'citylist'=>[21=>'上海','10'=>'北京'],
	'linelist'=>[1=>'家电相关',2=>'空气清洁'],
	'catlist'=>[1=>'家电类',2=>'家居类',3=>'地暖类',4=>'法律类'],
	'bizlist'=>[1=>'汇至美家',2=>'其他'],
	'boollist'=>[1=>'是',0=>'不是'],
	'hashkey'=>'huizi',
	'defaultpwd'=>'huizhi2017',
	'worklist'=>[1=>'上班',0=>'下班',2=>'生病或请假'],
        'workstatuslist'=>[1=>'在岗',0=>'不在岗'],
        'workstatuslist_minutesres'=>[1=>'正常',2=>'因公',0=>'其他'],
	'sftypelist'=>[1=>'师傅',0=>'学徒'],
	'timelist'=>[1=>'上午',2=>'下午',3=>'晚上',4=>'全天任意'],
	'timelist2'=>[1=>'上午',2=>'下午',3=>'晚上'],
	'timelimits'=>[1=>'120',2=>'120',3=>'120',4=>'480'],  /*每个师傅每个时间段的最大工作时间的阈值1和阈值2 */
	'timemargin'=>[1=>'30',2=>'30',3=>'30',4=>'90'],   /* 每个师傅的冗余时间 */
	'paywaylist'=>[ 'wxpay' => '微信支付', 'alipay' => '支付宝', 'yue' => '余额支付', 'daifu' => '师傅代付','quan'=>'优惠券','jifen'=>'积分'],
	'orderloglevel'=>['info' => '普通', 'danger' => '危险', 'warning' => '警告'],
	'order_sourcelist'=>['phone'=>'电话','weixin'=>'微信','taobao'=>'淘宝','dianping'=>'点评','58'=>'58到家','huizhi'=>'内部'], 
	'zonelist'=>
		[2101=>'虹口,杨浦,长宁,闸北',2102=>'嘉定',2103=>'宝山',2104=>'浦东市区',2105=>'川沙',2106=>'南汇',2107=>'青浦',2108=>'松江'],
	'orderstatuslist'=>[0=>'新建订单，待支付',1=>'订单已接单',10=>'订单完成支付',11=>'订单等待线下支付',20=>'成功派单',30=>'上门服务中',31=>'服务进行中',35=>'服务完成，等待余款结清',100=>'订单完成且余款结清',101=>'订单完成，用户评价完成','110'=>'订单回访完毕'] ,
	'dayu_key'=>'23573620',
	'dayu_secret'=>'4c864f0b2623a5d92d92aa1920ddba20',
	'off_weekidx_list'=>[1=>'周一',2=>'周二',3=>'周三',4=>'周四',5=>'周五',6=>'周六',7=>'周日',0=>'不休息']	
	
];
