models/Admin.php

    public static function findByUsername($username)
    {
//        foreach (self::$users as $user) {
//            if (strcasecmp($user['username'], $username) === 0) {
//                return new static($user);
//            }
//        }
//
//        return null;
        $user = Admin::find()
            ->where(['name' => $username])
            ->asArray()
            ->one();
---
SELECT * FROM `tbl_admin` WHERE `name`='xiaomi'