models/Category.php

SELECT * FROM `tbl_category` WHERE `parent_id`=0
---
	public function list_all()
	{
		$res_all = Category::findAll(['parent_id'=>0]);