models/Product.php

SELECT * FROM `tbl_product`
---
	public function list_all()
	{
		$res_all = Product::find()->all();