models/Shifu.php

	public function list_all()
	{
		$res_all = Shifu::find()->all();
---
SELECT * FROM `tbl_shifu`